EDT/MPCurier/src/Catalogs/КалендариДоставки/КалендариДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КалендариДоставки</name>
  <attributes>
    <name>ДнейСМоментаПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДниДоставки</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/MPCurier/src/CommonForms/ФормаВводаДаты/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииФормыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаСеанса = ТекущаяДатаСеанса();
	КалендарьДоставки = Параметры.КалендарьДоставки;
	ДатаРейса = Параметры.ДатаРейса;
	ПричинаОтказаПереноса = Параметры.ПричинаОтказаПереноса;
	Заказ = Параметры.Заказ;
	РезультатДоставки = Параметры.РезультатДоставки;
	Рейс = Параметры.Рейс;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Асинх Процедура ОК(Команда)
	Если ЗначениеЗаполнено(ДатаРейса) Тогда
		ДатаОтсчета = ДатаРейса;
	Иначе
		ДатаОтсчета = ДатаСеанса;
	КонецЕсли;	
	
	СтрокаДоступныхДнейДоставки = "";
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "Дата";
		Сообщение.Текст = "Не указана дата!";
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли НачалоДня(Дата) < НачалоДня(ДатаОтсчета + 86400) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Поле = "Дата";
		Сообщение.Текст = "Выбрана неверная дата!";
		Сообщение.Сообщить();
		Возврат;
	ИначеЕсли НачалоДня(Дата) > НачалоДня(ДатаОтсчета + 86400*15) Тогда	
		ОтветПользователя = Ждать ВопросАсинх("Дата переноса больше чем 2 недели. Вы уверены?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецеСли;	
	ИначеЕсли Не ПроверкаНаКалендарьДоставки(СтрокаДоступныхДнейДоставки) Тогда
		ОтветПользователя = Ждать ВопросАсинх("Дата переноса не соответствует доступным дням доставки по календарю доставки (" + СтрокаДоступныхДнейДоставки + "). Вы уверены, что хотите выбрать указанную дату доставки?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если ОтветПользователя = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецеСли;	
	КонецеСли;
		
	ПараметрыЗакрытияФормы = Новый Структура("РезультатВыполнения, ДатаПереносаДоставки, Заказ", Истина, Дата, Заказ);
	ПараметрыЗакрытияФормы.Вставить("РезультатДоставки", РезультатДоставки);
	ПараметрыЗакрытияФормы.Вставить("ПричинаОтказаПереноса", ПричинаОтказаПереноса);
	ПараметрыЗакрытияФормы.Вставить("Рейс", Рейс);
	Закрыть(ПараметрыЗакрытияФормы);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриОткрытииФормыНаСервере()
	Если ЗначениеЗаполнено(ДатаРейса) Тогда
		ДатаОтсчета = ДатаРейса;
	Иначе
		ДатаОтсчета = ДатаСеанса;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КалендариДоставкиДниДоставки.ДеньНедели КАК ДеньНедели
	|ИЗ
	|	Справочник.КалендариДоставки.ДниДоставки КАК КалендариДоставкиДниДоставки
	|ГДЕ
	|	КалендариДоставкиДниДоставки.Ссылка = &КалендарьДоставки";
	Запрос.УстановитьПараметр("КалендарьДоставки", КалендарьДоставки);
	ДниДоставок.Загрузить(Запрос.Выполнить().Выгрузить());
		
	Если Не КалендарьДоставки.Пустая() Тогда
		ОбрДата = ДатаОтсчета + 86400;
		Для Сч = 1 По 7 Цикл
			СтрукПоиска = Новый СТруктура;
			СтрукПоиска.Вставить("ДеньНедели", ДеньНедели(ОбрДата));
			НайСтроки = ДниДоставок.НайтиСтроки(СтрукПоиска);
			Если НайСтроки.Количество() > 0 Тогда
				Дата = ОбрДата;
				Прервать;
			Иначе
				ОбрДата = ОбрДата + 86400;;
			КонецеСли;	
		КонецЦикла;	
		Дата = ОбрДата;
	КонецеСли;	
КонецПроцедуры

&НаСервере
Функция ПроверкаНаКалендарьДоставки(СтрокаДнейДоставки)
	Если Не КалендарьДоставки.Пустая() Тогда
		СтрокаДнейДоставки = "";
		Для Каждого Тек Из ДниДоставок Цикл
			Если Тек.ДеньНедели = 1 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "пн ";
			ИначеЕсли Тек.ДеньНедели = 2 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "вт ";
			ИначеЕсли Тек.ДеньНедели = 3 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "ср ";
			ИначеЕсли Тек.ДеньНедели = 4 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "чт ";
			ИначеЕсли Тек.ДеньНедели = 5 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "пт ";
			ИначеЕсли Тек.ДеньНедели = 6 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "сб ";
			ИначеЕсли Тек.ДеньНедели = 7 Тогда
				СтрокаДнейДоставки = СтрокаДнейДоставки + "вс ";
			КонецЕсли;	
		КонецЦикла;	
		СтрокаДнейДоставки = СокрЛП(СтрокаДнейДоставки);
		
		СтрукПоиска = Новый СТруктура;
		СтрукПоиска.Вставить("ДеньНедели", ДеньНедели(Дата));
		НайСтроки = ДниДоставок.НайтиСтроки(СтрукПоиска);
		Если НайСтроки.Количество() > 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецеСли;	
	Иначе
		Возврат Истина;
	КонецеСли;	
КонецФункции	

#КонецОбласти
